// Приклад програми на JavaScript, яка здійснює діалог з користувачем та отримує відповіді на три запитання, які можуть бути відповіддю "так" або "ні"

// оголошення змінних
let answer1, answer2, answer3;

// функція prompt() -створює діалогове вікно в браузері з запитанням та полем для введення відповіді
// Користувач може ввести одне з двох значень: "так" або "ні"
// Відповіді записуються в змінні answer1, answer2 та answer3 
answer1 = prompt("Чи подобається вам програмування на JavaScript?", "так/ні");
answer2 = prompt("Чи знаєте ви, що таке змінні та як їх використовувати?", "так/ні");
answer3 = prompt("Чи бажаєте ви дізнатися більше про JavaScript?", "так/ні");

// значення записані в змінні виводяться в консоль за допомогою функції console.log().
console.log("Ваші відповіді:");
console.log("1. " + answer1);
console.log("2. " + answer2);
console.log("3. " + answer3);
